byungchul1885/amigo_m2354_jnd_production/nonsecure/src/App/platform/sec_meter/app/disp.h

#ifndef DISP_H
#define DISP_H 1

#if 0 /* bccho, 2023-07-20 */
#include "stm32l4xx_hal_lcd.h"
#endif /* bccho */
#include "amg_lcd.h"
#include "whm.h"
#include "options_sel.h"

#define DISP_CIRC_PERIOD 5

#define NUM_MODE_DIGIT 8
#define LAST_DIGIT_INDEX (NUM_MODE_DIGIT - 1)
#define NUM_MODE 2
#define NUM_DIGIT (NUM_MODE_DIGIT - NUM_MODE)
#define MAX_LCD_DIGIT_KWH 1000000L
#define LCD_MAP_SIZE 13

#define lcd_w_point 2
#define lcd_w_point 2
#if PHASE_NUM == SINGLE_PHASE
#define lcd_wh_point 1
#else
#define lcd_wh_point 0
#endif
#define lcd_pf_point 2

typedef enum
{
    DISP_CIRC_STATE,
    DISP_INPUT_STATE,
    DISP_TEST_STATE,
    DISP_CAL_STATE,
    DISP_DR_STATE,
    DISP_CALFAIL_STATE,
    DISP_R_SUN_STATE,
    DISP_ON_SUN_STATE,
    DISP_CAL_END_STATE,          // 전류 표시
    DISP_CAL_MEM_BK_STATE,       // cal end 표시
    DISP_SUN_VER_INIT_ERR_STATE  // SUN 버전 초기화 오류 표시
} disp_state_type;

typedef enum
{
    DISPINP_DATE,
    DISPINP_TIME,
    DISPINP_REGREAD_DATE,
    DISPINP_SIGSEL,
    DISPINP_sCURR,
    DISPINP_sCURR_aRTN,
    DISPINP_TS,
    DISPINP_RATEKIND,
    DISPINP_TOU,
    DISPINP_DMINTV,
    DISPINP_SN_1,
    DISPINP_SN_2,
    DISPINP_MT_DIR,
    DISPINP_MEAS,
    DISPINP_BAUD,
    DISPINP_TEMP,
    DISPINP_ERR_PLS,
    DISPINP_CONDENSOR,
    DISPINP_COMMEN_COVEROPEN,
    DISPINP_sCURR_HOLD,
    DISPINP_sCURR_RTN1,
    DISPINP_sCURR_RTN_DUR1,
    DISPINP_sCURR_RTN_DUR2,
    DISPINP_sCURR_2,
    DSPINP_CONTRACT_MONTH,
    DISPINP_END
} disp_input_type;

typedef enum
{
    DSPMODE_INIT,
    // 날자/시간
    DSPMODE_DATE,
    DSPMODE_TIME,
    // 현월 (DSPMODE_CU_IMP_ACT_A 은 첫번재,  DSPMODE_CU_EXP_APP_T 는 마지막
    // enum 값) 현월 (DSPMODE_CU_IMP_ACT_MX_A 은 첫번재,
    // DSPMODE_CU_EXP_APP_CUMMX_T 는 마지막 enum 값)
    DSPMODE_CU_IMP_ACT_A,
    DSPMODE_CU_IMP_ACT_B,
    DSPMODE_CU_IMP_ACT_C,
    DSPMODE_CU_IMP_ACT_D,
    DSPMODE_CU_IMP_ACT_E,
    DSPMODE_CU_IMP_ACT_F,
    DSPMODE_CU_IMP_ACT_G,
    DSPMODE_CU_IMP_ACT_H,
    DSPMODE_CU_IMP_ACT_T,
    DSPMODE_CU_EXP_ACT_A,
    DSPMODE_CU_EXP_ACT_B,
    DSPMODE_CU_EXP_ACT_C,
    DSPMODE_CU_EXP_ACT_D,
    DSPMODE_CU_EXP_ACT_E,
    DSPMODE_CU_EXP_ACT_F,
    DSPMODE_CU_EXP_ACT_G,
    DSPMODE_CU_EXP_ACT_H,
    DSPMODE_CU_EXP_ACT_T,
    DSPMODE_CU_IMP_REACT_A,
    DSPMODE_CU_IMP_REACT_B,
    DSPMODE_CU_IMP_REACT_C,
    DSPMODE_CU_IMP_REACT_D,
    DSPMODE_CU_IMP_REACT_E,
    DSPMODE_CU_IMP_REACT_F,
    DSPMODE_CU_IMP_REACT_G,
    DSPMODE_CU_IMP_REACT_H,
    DSPMODE_CU_IMP_REACT_T,
    DSPMODE_CU_IMP_lagREACT_A,
    DSPMODE_CU_IMP_lagREACT_B,
    DSPMODE_CU_IMP_lagREACT_C,
    DSPMODE_CU_IMP_lagREACT_D,
    DSPMODE_CU_IMP_lagREACT_E,
    DSPMODE_CU_IMP_lagREACT_F,
    DSPMODE_CU_IMP_lagREACT_G,
    DSPMODE_CU_IMP_lagREACT_H,
    DSPMODE_CU_IMP_lagREACT_T,
    DSPMODE_CU_IMP_leadREACT_A,
    DSPMODE_CU_IMP_leadREACT_B,
    DSPMODE_CU_IMP_leadREACT_C,
    DSPMODE_CU_IMP_leadREACT_D,
    DSPMODE_CU_IMP_leadREACT_E,
    DSPMODE_CU_IMP_leadREACT_F,
    DSPMODE_CU_IMP_leadREACT_G,
    DSPMODE_CU_IMP_leadREACT_H,
    DSPMODE_CU_IMP_leadREACT_T,
    DSPMODE_CU_EXP_REACT_A,
    DSPMODE_CU_EXP_REACT_B,
    DSPMODE_CU_EXP_REACT_C,
    DSPMODE_CU_EXP_REACT_D,
    DSPMODE_CU_EXP_REACT_E,
    DSPMODE_CU_EXP_REACT_F,
    DSPMODE_CU_EXP_REACT_G,
    DSPMODE_CU_EXP_REACT_H,
    DSPMODE_CU_EXP_REACT_T,
    DSPMODE_CU_EXP_lagREACT_A,
    DSPMODE_CU_EXP_lagREACT_B,
    DSPMODE_CU_EXP_lagREACT_C,
    DSPMODE_CU_EXP_lagREACT_D,
    DSPMODE_CU_EXP_lagREACT_E,
    DSPMODE_CU_EXP_lagREACT_F,
    DSPMODE_CU_EXP_lagREACT_G,
    DSPMODE_CU_EXP_lagREACT_H,
    DSPMODE_CU_EXP_lagREACT_T,
    DSPMODE_CU_EXP_leadREACT_A,
    DSPMODE_CU_EXP_leadREACT_B,
    DSPMODE_CU_EXP_leadREACT_C,
    DSPMODE_CU_EXP_leadREACT_D,
    DSPMODE_CU_EXP_leadREACT_E,
    DSPMODE_CU_EXP_leadREACT_F,
    DSPMODE_CU_EXP_leadREACT_G,
    DSPMODE_CU_EXP_leadREACT_H,
    DSPMODE_CU_EXP_leadREACT_T,
    DSPMODE_CU_IMP_APP_A,
    DSPMODE_CU_IMP_APP_B,
    DSPMODE_CU_IMP_APP_C,
    DSPMODE_CU_IMP_APP_D,
    DSPMODE_CU_IMP_APP_E,
    DSPMODE_CU_IMP_APP_F,
    DSPMODE_CU_IMP_APP_G,
    DSPMODE_CU_IMP_APP_H,
    DSPMODE_CU_IMP_APP_T,
    DSPMODE_CU_EXP_APP_A,
    DSPMODE_CU_EXP_APP_B,
    DSPMODE_CU_EXP_APP_C,
    DSPMODE_CU_EXP_APP_D,
    DSPMODE_CU_EXP_APP_E,
    DSPMODE_CU_EXP_APP_F,
    DSPMODE_CU_EXP_APP_G,
    DSPMODE_CU_EXP_APP_H,
    DSPMODE_CU_EXP_APP_T,
    DSPMODE_CU_IMP_ACT_MX_A,
    DSPMODE_CU_IMP_ACT_MX_B,
    DSPMODE_CU_IMP_ACT_MX_C,
    DSPMODE_CU_IMP_ACT_MX_D,
    DSPMODE_CU_IMP_ACT_MX_E,
    DSPMODE_CU_IMP_ACT_MX_F,
    DSPMODE_CU_IMP_ACT_MX_G,
    DSPMODE_CU_IMP_ACT_MX_H,
    DSPMODE_CU_IMP_ACT_MX_T,
    DSPMODE_CU_EXP_ACT_MX_A,
    DSPMODE_CU_EXP_ACT_MX_B,
    DSPMODE_CU_EXP_ACT_MX_C,
    DSPMODE_CU_EXP_ACT_MX_D,
    DSPMODE_CU_EXP_ACT_MX_E,
    DSPMODE_CU_EXP_ACT_MX_F,
    DSPMODE_CU_EXP_ACT_MX_G,
    DSPMODE_CU_EXP_ACT_MX_H,
    DSPMODE_CU_EXP_ACT_MX_T,
    DSPMODE_CU_IMP_APP_MX_A,
    DSPMODE_CU_IMP_APP_MX_B,
    DSPMODE_CU_IMP_APP_MX_C,
    DSPMODE_CU_IMP_APP_MX_D,
    DSPMODE_CU_IMP_APP_MX_E,
    DSPMODE_CU_IMP_APP_MX_F,
    DSPMODE_CU_IMP_APP_MX_G,
    DSPMODE_CU_IMP_APP_MX_H,
    DSPMODE_CU_IMP_APP_MX_T,
    DSPMODE_CU_EXP_APP_MX_A,
    DSPMODE_CU_EXP_APP_MX_B,
    DSPMODE_CU_EXP_APP_MX_C,
    DSPMODE_CU_EXP_APP_MX_D,
    DSPMODE_CU_EXP_APP_MX_E,
    DSPMODE_CU_EXP_APP_MX_F,
    DSPMODE_CU_EXP_APP_MX_G,
    DSPMODE_CU_EXP_APP_MX_H,
    DSPMODE_CU_EXP_APP_MX_T,
    // DSPMODE_CU_IMP_ACT_MXTIM 배치 (see dsp_mode_is_mxtim())
    DSPMODE_CU_IMP_ACT_MXTIM_A,
    DSPMODE_CU_IMP_ACT_MXTIM_B,
    DSPMODE_CU_IMP_ACT_MXTIM_C,
    DSPMODE_CU_IMP_ACT_MXTIM_D,
    DSPMODE_CU_IMP_ACT_MXTIM_E,
    DSPMODE_CU_IMP_ACT_MXTIM_F,
    DSPMODE_CU_IMP_ACT_MXTIM_G,
    DSPMODE_CU_IMP_ACT_MXTIM_H,
    DSPMODE_CU_IMP_ACT_MXTIM_T,
    DSPMODE_CU_EXP_ACT_MXTIM_A,
    DSPMODE_CU_EXP_ACT_MXTIM_B,
    DSPMODE_CU_EXP_ACT_MXTIM_C,
    DSPMODE_CU_EXP_ACT_MXTIM_D,
    DSPMODE_CU_EXP_ACT_MXTIM_E,
    DSPMODE_CU_EXP_ACT_MXTIM_F,
    DSPMODE_CU_EXP_ACT_MXTIM_G,
    DSPMODE_CU_EXP_ACT_MXTIM_H,
    DSPMODE_CU_EXP_ACT_MXTIM_T,
    DSPMODE_CU_IMP_APP_MXTIM_A,
    DSPMODE_CU_IMP_APP_MXTIM_B,
    DSPMODE_CU_IMP_APP_MXTIM_C,
    DSPMODE_CU_IMP_APP_MXTIM_D,
    DSPMODE_CU_IMP_APP_MXTIM_E,
    DSPMODE_CU_IMP_APP_MXTIM_F,
    DSPMODE_CU_IMP_APP_MXTIM_G,
    DSPMODE_CU_IMP_APP_MXTIM_H,
    DSPMODE_CU_IMP_APP_MXTIM_T,
    DSPMODE_CU_EXP_APP_MXTIM_A,
    DSPMODE_CU_EXP_APP_MXTIM_B,
    DSPMODE_CU_EXP_APP_MXTIM_C,
    DSPMODE_CU_EXP_APP_MXTIM_D,
    DSPMODE_CU_EXP_APP_MXTIM_E,
    DSPMODE_CU_EXP_APP_MXTIM_F,
    DSPMODE_CU_EXP_APP_MXTIM_G,
    DSPMODE_CU_EXP_APP_MXTIM_H,
    DSPMODE_CU_EXP_APP_MXTIM_T,
    DSPMODE_CU_IMP_ACT_CUMMX_A,
    DSPMODE_CU_IMP_ACT_CUMMX_B,
    DSPMODE_CU_IMP_ACT_CUMMX_C,
    DSPMODE_CU_IMP_ACT_CUMMX_D,
    DSPMODE_CU_IMP_ACT_CUMMX_E,
    DSPMODE_CU_IMP_ACT_CUMMX_F,
    DSPMODE_CU_IMP_ACT_CUMMX_G,
    DSPMODE_CU_IMP_ACT_CUMMX_H,
    DSPMODE_CU_IMP_ACT_CUMMX_T,
    DSPMODE_CU_EXP_ACT_CUMMX_A,
    DSPMODE_CU_EXP_ACT_CUMMX_B,
    DSPMODE_CU_EXP_ACT_CUMMX_C,
    DSPMODE_CU_EXP_ACT_CUMMX_D,
    DSPMODE_CU_EXP_ACT_CUMMX_E,
    DSPMODE_CU_EXP_ACT_CUMMX_F,
    DSPMODE_CU_EXP_ACT_CUMMX_G,
    DSPMODE_CU_EXP_ACT_CUMMX_H,
    DSPMODE_CU_EXP_ACT_CUMMX_T,
    DSPMODE_CU_IMP_APP_CUMMX_A,
    DSPMODE_CU_IMP_APP_CUMMX_B,
    DSPMODE_CU_IMP_APP_CUMMX_C,
    DSPMODE_CU_IMP_APP_CUMMX_D,
    DSPMODE_CU_IMP_APP_CUMMX_E,
    DSPMODE_CU_IMP_APP_CUMMX_F,
    DSPMODE_CU_IMP_APP_CUMMX_G,
    DSPMODE_CU_IMP_APP_CUMMX_H,
    DSPMODE_CU_IMP_APP_CUMMX_T,
    DSPMODE_CU_EXP_APP_CUMMX_A,
    DSPMODE_CU_EXP_APP_CUMMX_B,
    DSPMODE_CU_EXP_APP_CUMMX_C,
    DSPMODE_CU_EXP_APP_CUMMX_D,
    DSPMODE_CU_EXP_APP_CUMMX_E,
    DSPMODE_CU_EXP_APP_CUMMX_F,
    DSPMODE_CU_EXP_APP_CUMMX_G,
    DSPMODE_CU_EXP_APP_CUMMX_H,
    DSPMODE_CU_EXP_APP_CUMMX_T,
    DSPMODE_CU_IMP_PF_A,
    DSPMODE_CU_IMP_PF_B,
    DSPMODE_CU_IMP_PF_C,
    DSPMODE_CU_IMP_PF_D,
    DSPMODE_CU_IMP_PF_E,
    DSPMODE_CU_IMP_PF_F,
    DSPMODE_CU_IMP_PF_G,
    DSPMODE_CU_IMP_PF_H,
    DSPMODE_CU_IMP_PF_T,
    DSPMODE_CU_EXP_PF_A,
    DSPMODE_CU_EXP_PF_B,
    DSPMODE_CU_EXP_PF_C,
    DSPMODE_CU_EXP_PF_D,
    DSPMODE_CU_EXP_PF_E,
    DSPMODE_CU_EXP_PF_F,
    DSPMODE_CU_EXP_PF_G,
    DSPMODE_CU_EXP_PF_H,
    DSPMODE_CU_EXP_PF_T,
    // 전월 (DSPMODE_BF_IMP_ACT_A 은 첫번재 enum 값)
    DSPMODE_BF_IMP_ACT_A,
    DSPMODE_BF_IMP_ACT_B,
    DSPMODE_BF_IMP_ACT_C,
    DSPMODE_BF_IMP_ACT_D,
    DSPMODE_BF_IMP_ACT_E,
    DSPMODE_BF_IMP_ACT_F,
    DSPMODE_BF_IMP_ACT_G,
    DSPMODE_BF_IMP_ACT_H,
    DSPMODE_BF_IMP_ACT_T,
    DSPMODE_BF_EXP_ACT_A,
    DSPMODE_BF_EXP_ACT_B,
    DSPMODE_BF_EXP_ACT_C,
    DSPMODE_BF_EXP_ACT_D,
    DSPMODE_BF_EXP_ACT_E,
    DSPMODE_BF_EXP_ACT_F,
    DSPMODE_BF_EXP_ACT_G,
    DSPMODE_BF_EXP_ACT_H,
    DSPMODE_BF_EXP_ACT_T,
    DSPMODE_BF_IMP_REACT_A,
    DSPMODE_BF_IMP_REACT_B,
    DSPMODE_BF_IMP_REACT_C,
    DSPMODE_BF_IMP_REACT_D,
    DSPMODE_BF_IMP_REACT_E,
    DSPMODE_BF_IMP_REACT_F,
    DSPMODE_BF_IMP_REACT_G,
    DSPMODE_BF_IMP_REACT_H,
    DSPMODE_BF_IMP_REACT_T,
    DSPMODE_BF_IMP_lagREACT_A,
    DSPMODE_BF_IMP_lagREACT_B,
    DSPMODE_BF_IMP_lagREACT_C,
    DSPMODE_BF_IMP_lagREACT_D,
    DSPMODE_BF_IMP_lagREACT_E,
    DSPMODE_BF_IMP_lagREACT_F,
    DSPMODE_BF_IMP_lagREACT_G,
    DSPMODE_BF_IMP_lagREACT_H,
    DSPMODE_BF_IMP_lagREACT_T,
    DSPMODE_BF_IMP_leadREACT_A,
    DSPMODE_BF_IMP_leadREACT_B,
    DSPMODE_BF_IMP_leadREACT_C,
    DSPMODE_BF_IMP_leadREACT_D,
    DSPMODE_BF_IMP_leadREACT_E,
    DSPMODE_BF_IMP_leadREACT_F,
    DSPMODE_BF_IMP_leadREACT_G,
    DSPMODE_BF_IMP_leadREACT_H,
    DSPMODE_BF_IMP_leadREACT_T,
    DSPMODE_BF_EXP_REACT_A,
    DSPMODE_BF_EXP_REACT_B,
    DSPMODE_BF_EXP_REACT_C,
    DSPMODE_BF_EXP_REACT_D,
    DSPMODE_BF_EXP_REACT_E,
    DSPMODE_BF_EXP_REACT_F,
    DSPMODE_BF_EXP_REACT_G,
    DSPMODE_BF_EXP_REACT_H,
    DSPMODE_BF_EXP_REACT_T,
    DSPMODE_BF_EXP_lagREACT_A,
    DSPMODE_BF_EXP_lagREACT_B,
    DSPMODE_BF_EXP_lagREACT_C,
    DSPMODE_BF_EXP_lagREACT_D,
    DSPMODE_BF_EXP_lagREACT_E,
    DSPMODE_BF_EXP_lagREACT_F,
    DSPMODE_BF_EXP_lagREACT_G,
    DSPMODE_BF_EXP_lagREACT_H,
    DSPMODE_BF_EXP_lagREACT_T,
    DSPMODE_BF_EXP_leadREACT_A,
    DSPMODE_BF_EXP_leadREACT_B,
    DSPMODE_BF_EXP_leadREACT_C,
    DSPMODE_BF_EXP_leadREACT_D,
    DSPMODE_BF_EXP_leadREACT_E,
    DSPMODE_BF_EXP_leadREACT_F,
    DSPMODE_BF_EXP_leadREACT_G,
    DSPMODE_BF_EXP_leadREACT_H,
    DSPMODE_BF_EXP_leadREACT_T,
    DSPMODE_BF_IMP_APP_A,
    DSPMODE_BF_IMP_APP_B,
    DSPMODE_BF_IMP_APP_C,
    DSPMODE_BF_IMP_APP_D,
    DSPMODE_BF_IMP_APP_E,
    DSPMODE_BF_IMP_APP_F,
    DSPMODE_BF_IMP_APP_G,
    DSPMODE_BF_IMP_APP_H,
    DSPMODE_BF_IMP_APP_T,
    DSPMODE_BF_EXP_APP_A,
    DSPMODE_BF_EXP_APP_B,
    DSPMODE_BF_EXP_APP_C,
    DSPMODE_BF_EXP_APP_D,
    DSPMODE_BF_EXP_APP_E,
    DSPMODE_BF_EXP_APP_F,
    DSPMODE_BF_EXP_APP_G,
    DSPMODE_BF_EXP_APP_H,
    DSPMODE_BF_EXP_APP_T,
    DSPMODE_BF_IMP_ACT_MX_A,
    DSPMODE_BF_IMP_ACT_MX_B,
    DSPMODE_BF_IMP_ACT_MX_C,
    DSPMODE_BF_IMP_ACT_MX_D,
    DSPMODE_BF_IMP_ACT_MX_E,
    DSPMODE_BF_IMP_ACT_MX_F,
    DSPMODE_BF_IMP_ACT_MX_G,
    DSPMODE_BF_IMP_ACT_MX_H,
    DSPMODE_BF_IMP_ACT_MX_T,
    DSPMODE_BF_EXP_ACT_MX_A,
    DSPMODE_BF_EXP_ACT_MX_B,
    DSPMODE_BF_EXP_ACT_MX_C,
    DSPMODE_BF_EXP_ACT_MX_D,
    DSPMODE_BF_EXP_ACT_MX_E,
    DSPMODE_BF_EXP_ACT_MX_F,
    DSPMODE_BF_EXP_ACT_MX_G,
    DSPMODE_BF_EXP_ACT_MX_H,
    DSPMODE_BF_EXP_ACT_MX_T,
    DSPMODE_BF_IMP_APP_MX_A,
    DSPMODE_BF_IMP_APP_MX_B,
    DSPMODE_BF_IMP_APP_MX_C,
    DSPMODE_BF_IMP_APP_MX_D,
    DSPMODE_BF_IMP_APP_MX_E,
    DSPMODE_BF_IMP_APP_MX_F,
    DSPMODE_BF_IMP_APP_MX_G,
    DSPMODE_BF_IMP_APP_MX_H,
    DSPMODE_BF_IMP_APP_MX_T,
    DSPMODE_BF_EXP_APP_MX_A,
    DSPMODE_BF_EXP_APP_MX_B,
    DSPMODE_BF_EXP_APP_MX_C,
    DSPMODE_BF_EXP_APP_MX_D,
    DSPMODE_BF_EXP_APP_MX_E,
    DSPMODE_BF_EXP_APP_MX_F,
    DSPMODE_BF_EXP_APP_MX_G,
    DSPMODE_BF_EXP_APP_MX_H,
    DSPMODE_BF_EXP_APP_MX_T,
    // DSPMODE_BF_IMP_ACT_MXTIM 배치 (see dsp_mode_is_mxtim())
    DSPMODE_BF_IMP_ACT_MXTIM_A,
    DSPMODE_BF_IMP_ACT_MXTIM_B,
    DSPMODE_BF_IMP_ACT_MXTIM_C,
    DSPMODE_BF_IMP_ACT_MXTIM_D,
    DSPMODE_BF_IMP_ACT_MXTIM_E,
    DSPMODE_BF_IMP_ACT_MXTIM_F,
    DSPMODE_BF_IMP_ACT_MXTIM_G,
    DSPMODE_BF_IMP_ACT_MXTIM_H,
    DSPMODE_BF_IMP_ACT_MXTIM_T,
    DSPMODE_BF_EXP_ACT_MXTIM_A,
    DSPMODE_BF_EXP_ACT_MXTIM_B,
    DSPMODE_BF_EXP_ACT_MXTIM_C,
    DSPMODE_BF_EXP_ACT_MXTIM_D,
    DSPMODE_BF_EXP_ACT_MXTIM_E,
    DSPMODE_BF_EXP_ACT_MXTIM_F,
    DSPMODE_BF_EXP_ACT_MXTIM_G,
    DSPMODE_BF_EXP_ACT_MXTIM_H,
    DSPMODE_BF_EXP_ACT_MXTIM_T,
    DSPMODE_BF_IMP_APP_MXTIM_A,
    DSPMODE_BF_IMP_APP_MXTIM_B,
    DSPMODE_BF_IMP_APP_MXTIM_C,
    DSPMODE_BF_IMP_APP_MXTIM_D,
    DSPMODE_BF_IMP_APP_MXTIM_E,
    DSPMODE_BF_IMP_APP_MXTIM_F,
    DSPMODE_BF_IMP_APP_MXTIM_G,
    DSPMODE_BF_IMP_APP_MXTIM_H,
    DSPMODE_BF_IMP_APP_MXTIM_T,
    DSPMODE_BF_EXP_APP_MXTIM_A,
    DSPMODE_BF_EXP_APP_MXTIM_B,
    DSPMODE_BF_EXP_APP_MXTIM_C,
    DSPMODE_BF_EXP_APP_MXTIM_D,
    DSPMODE_BF_EXP_APP_MXTIM_E,
    DSPMODE_BF_EXP_APP_MXTIM_F,
    DSPMODE_BF_EXP_APP_MXTIM_G,
    DSPMODE_BF_EXP_APP_MXTIM_H,
    DSPMODE_BF_EXP_APP_MXTIM_T,
    DSPMODE_BF_IMP_ACT_CUMMX_A,
    DSPMODE_BF_IMP_ACT_CUMMX_B,
    DSPMODE_BF_IMP_ACT_CUMMX_C,
    DSPMODE_BF_IMP_ACT_CUMMX_D,
    DSPMODE_BF_IMP_ACT_CUMMX_E,
    DSPMODE_BF_IMP_ACT_CUMMX_F,
    DSPMODE_BF_IMP_ACT_CUMMX_G,
    DSPMODE_BF_IMP_ACT_CUMMX_H,
    DSPMODE_BF_IMP_ACT_CUMMX_T,
    DSPMODE_BF_EXP_ACT_CUMMX_A,
    DSPMODE_BF_EXP_ACT_CUMMX_B,
    DSPMODE_BF_EXP_ACT_CUMMX_C,
    DSPMODE_BF_EXP_ACT_CUMMX_D,
    DSPMODE_BF_EXP_ACT_CUMMX_E,
    DSPMODE_BF_EXP_ACT_CUMMX_F,
    DSPMODE_BF_EXP_ACT_CUMMX_G,
    DSPMODE_BF_EXP_ACT_CUMMX_H,
    DSPMODE_BF_EXP_ACT_CUMMX_T,
    DSPMODE_BF_IMP_APP_CUMMX_A,
    DSPMODE_BF_IMP_APP_CUMMX_B,
    DSPMODE_BF_IMP_APP_CUMMX_C,
    DSPMODE_BF_IMP_APP_CUMMX_D,
    DSPMODE_BF_IMP_APP_CUMMX_E,
    DSPMODE_BF_IMP_APP_CUMMX_F,
    DSPMODE_BF_IMP_APP_CUMMX_G,
    DSPMODE_BF_IMP_APP_CUMMX_H,
    DSPMODE_BF_IMP_APP_CUMMX_T,
    DSPMODE_BF_EXP_APP_CUMMX_A,
    DSPMODE_BF_EXP_APP_CUMMX_B,
    DSPMODE_BF_EXP_APP_CUMMX_C,
    DSPMODE_BF_EXP_APP_CUMMX_D,
    DSPMODE_BF_EXP_APP_CUMMX_E,
    DSPMODE_BF_EXP_APP_CUMMX_F,
    DSPMODE_BF_EXP_APP_CUMMX_G,
    DSPMODE_BF_EXP_APP_CUMMX_H,
    DSPMODE_BF_EXP_APP_CUMMX_T,

    DSPMODE_BF_IMP_ACT_A_NPRD,
    DSPMODE_BF_IMP_ACT_B_NPRD,
    DSPMODE_BF_IMP_ACT_C_NPRD,
    DSPMODE_BF_IMP_ACT_D_NPRD,
    DSPMODE_BF_IMP_ACT_T_NPRD,
    DSPMODE_BF_EXP_ACT_A_NPRD,
    DSPMODE_BF_EXP_ACT_B_NPRD,
    DSPMODE_BF_EXP_ACT_C_NPRD,
    DSPMODE_BF_EXP_ACT_D_NPRD,
    DSPMODE_BF_EXP_ACT_T_NPRD,
    DSPMODE_BF_IMP_ACT_CUMMX_A_NPRD,
    DSPMODE_BF_IMP_ACT_CUMMX_B_NPRD,
    DSPMODE_BF_IMP_ACT_CUMMX_C_NPRD,
    DSPMODE_BF_IMP_ACT_CUMMX_D_NPRD,
    DSPMODE_BF_IMP_ACT_CUMMX_T_NPRD,

    DSPMODE_BF_IMP_PF_A,
    DSPMODE_BF_IMP_PF_B,
    DSPMODE_BF_IMP_PF_C,
    DSPMODE_BF_IMP_PF_D,
    DSPMODE_BF_IMP_PF_E,
    DSPMODE_BF_IMP_PF_F,
    DSPMODE_BF_IMP_PF_G,
    DSPMODE_BF_IMP_PF_H,
    DSPMODE_BF_IMP_PF_T,
    DSPMODE_BF_EXP_PF_A,
    DSPMODE_BF_EXP_PF_B,
    DSPMODE_BF_EXP_PF_C,
    DSPMODE_BF_EXP_PF_D,
    DSPMODE_BF_EXP_PF_E,
    DSPMODE_BF_EXP_PF_F,
    DSPMODE_BF_EXP_PF_G,
    DSPMODE_BF_EXP_PF_H,
    DSPMODE_BF_EXP_PF_T,
    // 전전월 (DSPMODE_BBF_EXP_PF_T 은 마지막 enum 값)
    DSPMODE_BBF_IMP_ACT_A,
    DSPMODE_BBF_IMP_ACT_B,
    DSPMODE_BBF_IMP_ACT_C,
    DSPMODE_BBF_IMP_ACT_D,
    DSPMODE_BBF_IMP_ACT_E,
    DSPMODE_BBF_IMP_ACT_F,
    DSPMODE_BBF_IMP_ACT_G,
    DSPMODE_BBF_IMP_ACT_H,
    DSPMODE_BBF_IMP_ACT_T,
    DSPMODE_BBF_EXP_ACT_A,
    DSPMODE_BBF_EXP_ACT_B,
    DSPMODE_BBF_EXP_ACT_C,
    DSPMODE_BBF_EXP_ACT_D,
    DSPMODE_BBF_EXP_ACT_E,
    DSPMODE_BBF_EXP_ACT_F,
    DSPMODE_BBF_EXP_ACT_G,
    DSPMODE_BBF_EXP_ACT_H,
    DSPMODE_BBF_EXP_ACT_T,
    DSPMODE_BBF_IMP_REACT_A,
    DSPMODE_BBF_IMP_REACT_B,
    DSPMODE_BBF_IMP_REACT_C,
    DSPMODE_BBF_IMP_REACT_D,
    DSPMODE_BBF_IMP_REACT_E,
    DSPMODE_BBF_IMP_REACT_F,
    DSPMODE_BBF_IMP_REACT_G,
    DSPMODE_BBF_IMP_REACT_H,
    DSPMODE_BBF_IMP_REACT_T,
    DSPMODE_BBF_IMP_lagREACT_A,
    DSPMODE_BBF_IMP_lagREACT_B,
    DSPMODE_BBF_IMP_lagREACT_C,
    DSPMODE_BBF_IMP_lagREACT_D,
    DSPMODE_BBF_IMP_lagREACT_E,
    DSPMODE_BBF_IMP_lagREACT_F,
    DSPMODE_BBF_IMP_lagREACT_G,
    DSPMODE_BBF_IMP_lagREACT_H,
    DSPMODE_BBF_IMP_lagREACT_T,
    DSPMODE_BBF_IMP_leadREACT_A,
    DSPMODE_BBF_IMP_leadREACT_B,
    DSPMODE_BBF_IMP_leadREACT_C,
    DSPMODE_BBF_IMP_leadREACT_D,
    DSPMODE_BBF_IMP_leadREACT_E,
    DSPMODE_BBF_IMP_leadREACT_F,
    DSPMODE_BBF_IMP_leadREACT_G,
    DSPMODE_BBF_IMP_leadREACT_H,
    DSPMODE_BBF_IMP_leadREACT_T,
    DSPMODE_BBF_EXP_REACT_A,
    DSPMODE_BBF_EXP_REACT_B,
    DSPMODE_BBF_EXP_REACT_C,
    DSPMODE_BBF_EXP_REACT_D,
    DSPMODE_BBF_EXP_REACT_E,
    DSPMODE_BBF_EXP_REACT_F,
    DSPMODE_BBF_EXP_REACT_G,
    DSPMODE_BBF_EXP_REACT_H,
    DSPMODE_BBF_EXP_REACT_T,
    DSPMODE_BBF_EXP_lagREACT_A,
    DSPMODE_BBF_EXP_lagREACT_B,
    DSPMODE_BBF_EXP_lagREACT_C,
    DSPMODE_BBF_EXP_lagREACT_D,
    DSPMODE_BBF_EXP_lagREACT_E,
    DSPMODE_BBF_EXP_lagREACT_F,
    DSPMODE_BBF_EXP_lagREACT_G,
    DSPMODE_BBF_EXP_lagREACT_H,
    DSPMODE_BBF_EXP_lagREACT_T,
    DSPMODE_BBF_EXP_leadREACT_A,
    DSPMODE_BBF_EXP_leadREACT_B,
    DSPMODE_BBF_EXP_leadREACT_C,
    DSPMODE_BBF_EXP_leadREACT_D,
    DSPMODE_BBF_EXP_leadREACT_E,
    DSPMODE_BBF_EXP_leadREACT_F,
    DSPMODE_BBF_EXP_leadREACT_G,
    DSPMODE_BBF_EXP_leadREACT_H,
    DSPMODE_BBF_EXP_leadREACT_T,
    DSPMODE_BBF_IMP_APP_A,
    DSPMODE_BBF_IMP_APP_B,
    DSPMODE_BBF_IMP_APP_C,
    DSPMODE_BBF_IMP_APP_D,
    DSPMODE_BBF_IMP_APP_E,
    DSPMODE_BBF_IMP_APP_F,
    DSPMODE_BBF_IMP_APP_G,
    DSPMODE_BBF_IMP_APP_H,
    DSPMODE_BBF_IMP_APP_T,
    DSPMODE_BBF_EXP_APP_A,
    DSPMODE_BBF_EXP_APP_B,
    DSPMODE_BBF_EXP_APP_C,
    DSPMODE_BBF_EXP_APP_D,
    DSPMODE_BBF_EXP_APP_E,
    DSPMODE_BBF_EXP_APP_F,
    DSPMODE_BBF_EXP_APP_G,
    DSPMODE_BBF_EXP_APP_H,
    DSPMODE_BBF_EXP_APP_T,
    DSPMODE_BBF_IMP_ACT_MX_A,
    DSPMODE_BBF_IMP_ACT_MX_B,
    DSPMODE_BBF_IMP_ACT_MX_C,
    DSPMODE_BBF_IMP_ACT_MX_D,
    DSPMODE_BBF_IMP_ACT_MX_E,
    DSPMODE_BBF_IMP_ACT_MX_F,
    DSPMODE_BBF_IMP_ACT_MX_G,
    DSPMODE_BBF_IMP_ACT_MX_H,
    DSPMODE_BBF_IMP_ACT_MX_T,
    DSPMODE_BBF_EXP_ACT_MX_A,
    DSPMODE_BBF_EXP_ACT_MX_B,
    DSPMODE_BBF_EXP_ACT_MX_C,
    DSPMODE_BBF_EXP_ACT_MX_D,
    DSPMODE_BBF_EXP_ACT_MX_E,
    DSPMODE_BBF_EXP_ACT_MX_F,
    DSPMODE_BBF_EXP_ACT_MX_G,
    DSPMODE_BBF_EXP_ACT_MX_H,
    DSPMODE_BBF_EXP_ACT_MX_T,
    DSPMODE_BBF_IMP_APP_MX_A,
    DSPMODE_BBF_IMP_APP_MX_B,
    DSPMODE_BBF_IMP_APP_MX_C,
    DSPMODE_BBF_IMP_APP_MX_D,
    DSPMODE_BBF_IMP_APP_MX_E,
    DSPMODE_BBF_IMP_APP_MX_F,
    DSPMODE_BBF_IMP_APP_MX_G,
    DSPMODE_BBF_IMP_APP_MX_H,
    DSPMODE_BBF_IMP_APP_MX_T,
    DSPMODE_BBF_EXP_APP_MX_A,
    DSPMODE_BBF_EXP_APP_MX_B,
    DSPMODE_BBF_EXP_APP_MX_C,
    DSPMODE_BBF_EXP_APP_MX_D,
    DSPMODE_BBF_EXP_APP_MX_E,
    DSPMODE_BBF_EXP_APP_MX_F,
    DSPMODE_BBF_EXP_APP_MX_G,
    DSPMODE_BBF_EXP_APP_MX_H,
    DSPMODE_BBF_EXP_APP_MX_T,
    // DSPMODE_BBF_IMP_ACT_MXTIM 배치 (see dsp_mode_is_mxtim())
    DSPMODE_BBF_IMP_ACT_MXTIM_A,
    DSPMODE_BBF_IMP_ACT_MXTIM_B,
    DSPMODE_BBF_IMP_ACT_MXTIM_C,
    DSPMODE_BBF_IMP_ACT_MXTIM_D,
    DSPMODE_BBF_IMP_ACT_MXTIM_E,
    DSPMODE_BBF_IMP_ACT_MXTIM_F,
    DSPMODE_BBF_IMP_ACT_MXTIM_G,
    DSPMODE_BBF_IMP_ACT_MXTIM_H,
    DSPMODE_BBF_IMP_ACT_MXTIM_T,
    DSPMODE_BBF_EXP_ACT_MXTIM_A,
    DSPMODE_BBF_EXP_ACT_MXTIM_B,
    DSPMODE_BBF_EXP_ACT_MXTIM_C,
    DSPMODE_BBF_EXP_ACT_MXTIM_D,
    DSPMODE_BBF_EXP_ACT_MXTIM_E,
    DSPMODE_BBF_EXP_ACT_MXTIM_F,
    DSPMODE_BBF_EXP_ACT_MXTIM_G,
    DSPMODE_BBF_EXP_ACT_MXTIM_H,
    DSPMODE_BBF_EXP_ACT_MXTIM_T,
    DSPMODE_BBF_IMP_APP_MXTIM_A,
    DSPMODE_BBF_IMP_APP_MXTIM_B,
    DSPMODE_BBF_IMP_APP_MXTIM_C,
    DSPMODE_BBF_IMP_APP_MXTIM_D,
    DSPMODE_BBF_IMP_APP_MXTIM_E,
    DSPMODE_BBF_IMP_APP_MXTIM_F,
    DSPMODE_BBF_IMP_APP_MXTIM_G,
    DSPMODE_BBF_IMP_APP_MXTIM_H,
    DSPMODE_BBF_IMP_APP_MXTIM_T,
    DSPMODE_BBF_EXP_APP_MXTIM_A,
    DSPMODE_BBF_EXP_APP_MXTIM_B,
    DSPMODE_BBF_EXP_APP_MXTIM_C,
    DSPMODE_BBF_EXP_APP_MXTIM_D,
    DSPMODE_BBF_EXP_APP_MXTIM_E,
    DSPMODE_BBF_EXP_APP_MXTIM_F,
    DSPMODE_BBF_EXP_APP_MXTIM_G,
    DSPMODE_BBF_EXP_APP_MXTIM_H,
    DSPMODE_BBF_EXP_APP_MXTIM_T,
    DSPMODE_BBF_IMP_ACT_CUMMX_A,
    DSPMODE_BBF_IMP_ACT_CUMMX_B,
    DSPMODE_BBF_IMP_ACT_CUMMX_C,
    DSPMODE_BBF_IMP_ACT_CUMMX_D,
    DSPMODE_BBF_IMP_ACT_CUMMX_E,
    DSPMODE_BBF_IMP_ACT_CUMMX_F,
    DSPMODE_BBF_IMP_ACT_CUMMX_G,
    DSPMODE_BBF_IMP_ACT_CUMMX_H,
    DSPMODE_BBF_IMP_ACT_CUMMX_T,
    DSPMODE_BBF_EXP_ACT_CUMMX_A,
    DSPMODE_BBF_EXP_ACT_CUMMX_B,
    DSPMODE_BBF_EXP_ACT_CUMMX_C,
    DSPMODE_BBF_EXP_ACT_CUMMX_D,
    DSPMODE_BBF_EXP_ACT_CUMMX_E,
    DSPMODE_BBF_EXP_ACT_CUMMX_F,
    DSPMODE_BBF_EXP_ACT_CUMMX_G,
    DSPMODE_BBF_EXP_ACT_CUMMX_H,
    DSPMODE_BBF_EXP_ACT_CUMMX_T,
    DSPMODE_BBF_IMP_APP_CUMMX_A,
    DSPMODE_BBF_IMP_APP_CUMMX_B,
    DSPMODE_BBF_IMP_APP_CUMMX_C,
    DSPMODE_BBF_IMP_APP_CUMMX_D,
    DSPMODE_BBF_IMP_APP_CUMMX_E,
    DSPMODE_BBF_IMP_APP_CUMMX_F,
    DSPMODE_BBF_IMP_APP_CUMMX_G,
    DSPMODE_BBF_IMP_APP_CUMMX_H,
    DSPMODE_BBF_IMP_APP_CUMMX_T,
    DSPMODE_BBF_EXP_APP_CUMMX_A,
    DSPMODE_BBF_EXP_APP_CUMMX_B,
    DSPMODE_BBF_EXP_APP_CUMMX_C,
    DSPMODE_BBF_EXP_APP_CUMMX_D,
    DSPMODE_BBF_EXP_APP_CUMMX_E,
    DSPMODE_BBF_EXP_APP_CUMMX_F,
    DSPMODE_BBF_EXP_APP_CUMMX_G,
    DSPMODE_BBF_EXP_APP_CUMMX_H,
    DSPMODE_BBF_EXP_APP_CUMMX_T,
    DSPMODE_BBF_IMP_PF_A,
    DSPMODE_BBF_IMP_PF_B,
    DSPMODE_BBF_IMP_PF_C,
    DSPMODE_BBF_IMP_PF_D,
    DSPMODE_BBF_IMP_PF_E,
    DSPMODE_BBF_IMP_PF_F,
    DSPMODE_BBF_IMP_PF_G,
    DSPMODE_BBF_IMP_PF_H,
    DSPMODE_BBF_IMP_PF_T,
    DSPMODE_BBF_EXP_PF_A,
    DSPMODE_BBF_EXP_PF_B,
    DSPMODE_BBF_EXP_PF_C,
    DSPMODE_BBF_EXP_PF_D,
    DSPMODE_BBF_EXP_PF_E,
    DSPMODE_BBF_EXP_PF_F,
    DSPMODE_BBF_EXP_PF_G,
    DSPMODE_BBF_EXP_PF_H,
    DSPMODE_BBF_EXP_PF_T,

