byungchul1885/amigo_m2354_jnd_production/nonsecure/src/App/platform/sec_meter/app/disp.h
    DSPMODE_BBF_IMP_ACT_A_NPRD,
    DSPMODE_BBF_IMP_ACT_B_NPRD,
    DSPMODE_BBF_IMP_ACT_C_NPRD,
    DSPMODE_BBF_IMP_ACT_D_NPRD,
    DSPMODE_BBF_IMP_ACT_T_NPRD,
    DSPMODE_BBF_EXP_ACT_A_NPRD,
    DSPMODE_BBF_EXP_ACT_B_NPRD,
    DSPMODE_BBF_EXP_ACT_C_NPRD,
    DSPMODE_BBF_EXP_ACT_D_NPRD,
    DSPMODE_BBF_EXP_ACT_T_NPRD,
    DSPMODE_BBF_IMP_ACT_CUMMX_A_NPRD,
    DSPMODE_BBF_IMP_ACT_CUMMX_B_NPRD,
    DSPMODE_BBF_IMP_ACT_CUMMX_C_NPRD,
    DSPMODE_BBF_IMP_ACT_CUMMX_D_NPRD,
    DSPMODE_BBF_IMP_ACT_CUMMX_T_NPRD,

    // 현재/직전
    DSPMODE_CURR_IMP_ACT,
    DSPMODE_CURR_IMP_APP,
    DSPMODE_CURR_EXP_ACT,
    DSPMODE_CURR_EXP_APP,  // next of BBF
    DSPMODE_LAST_IMP_ACT,
    DSPMODE_LAST_IMP_APP,
    DSPMODE_LAST_EXP_ACT,
    DSPMODE_LAST_EXP_APP,  // DSPMODE_LAST_EXP_APP is checked
    DSPMODE_LAST_EXP_PF,
    DSPMODE_LAST_IMP_PF,  // DSPMODE_LAST_IMP_PF is checked

#if 1 /* bccho, 2024-05-17 */
    DSPMODE_TOU_PROG_ID,
#endif
    DSPMODE_REG_DATE, /* 정기 검침일 */

    DSPMODE_mDR_NUM,
    DSPMODE_BUY_ENERGY,
    DSPMODE_BUY_MONEY,
    DSPMODE_REM_ENERGY,
    DSPMODE_REM_MONEY,
    DSPMODE_REM_TIME,
    DSPMODE_ERROR,

    // 시험 모드 (ce update => DSPMODE_V1 ~ DSPMODE_tRaw)  // + DSPMODE_REG_DATE

    DSPMODE_V1,
    DSPMODE_V2,
    DSPMODE_V3,
    DSPMODE_LtoL1,
    DSPMODE_LtoL2,
    DSPMODE_LtoL3,
    DSPMODE_I1,
    DSPMODE_I2,
    DSPMODE_I3,
    DSPMODE_P1,
    DSPMODE_P2,
    DSPMODE_P3,
    DSPMODE_THD_V1,
    DSPMODE_THD_V2,
    DSPMODE_THD_V3,
    DSPMODE_tS,
    DSPMODE_TEMP,
    DSPMODE_SMODE,
    DSPMODE_FREQ,
    DSPMODE_PVT,
    DSPMODE_SYSP_SW_VER,
    DSPMODE_MODEM_VER,
    DSPMODE_MTP_SW_VER,
    DSPMODE_485_BPS,
    DSPMODE_CONDENSOR_EN,
    DSPMODE_ERR_PULSE,
    DSPMODE_AUTO_BI_DIR_MODE,
    DSPMODE_OVERCURR,
    DSPMODE_ERR_RATE1,
    DSPMODE_ERR_RATE2,
    DSPMODE_ERR_RATE3,

    DSPMODE_LATCHON,
    DSPMODE_BILL5DAYS,
    DSPMODE_tRaw,
    DSPMODE_TEST_REG_DATE,
    DSPMODE_TARIFF_RATE,
    DSPMODE_SPEC_VER,

    NUM_DSPMODE
} disp_mode_type;

/* 3.17.1.2 관리자 순환 표시 모드 : 표시 가능 항목은 40개 이하로 제한되어야
 * 한다. */
// TODO: (WD)
#define MAX_SUPP_DSP_NUM 40
typedef struct
{
    uint8_t mode_cnt;
    uint8_t dsptime;
    uint16_t dsp_mode[MAX_SUPP_DSP_NUM];
    uint16_t CRC_M;
} dsp_supply_type;

#define dsp_is_suppdsp_available() (circ_state_suppdsp_mode.mode_cnt > 0)

#define SEG00 (1 << 0)
#define SEG01 (1 << 1)
#define SEG02 (1 << 2)
#define SEG03 (1 << 3)
#define SEG04 (1 << 4)
#define SEG05 (1 << 5)
#define SEG06 (1 << 6)
#define SEG07 (1 << 7)
#define SEG08 (1 << 8)
#define SEG09 (1 << 9)
#define SEG10 (1 << 10)
#define SEG11 (1 << 11)
#define SEG12 (1 << 12)
#define SEG13 (1 << 13)
#define SEG14 (1 << 14)
#define SEG15 (1 << 15)
#define SEG16 (1 << 16)
#define SEG17 (1 << 17)
#define SEG18 (1 << 18)
#define SEG19 (1 << 19)
#define SEG20 (1 << 20)
#define SEG21 (1 << 21)
#ifdef M2354_NEW_HW
#define SEG22 (1 << 23)
#define SEG23 (1 << 22)
#else
#define SEG22 (1 << 22)
#define SEG23 (1 << 23)
#endif
#define SEG24 (1 << 24)
#define SEG25 (1 << 25)
#define SEG26 (1 << 26)
#define SEG27 (1 << 27)
#define SEG28 (1 << 28)
#define SEG29 (1 << 29)
#define SEG30 (1 << 30)
#define SEG31 (1 << 31)
#define SEG32 (1 << 0)
#define SEG33 (1 << 1)
#define SEG34 (1 << 2)
#define SEG35 (1 << 3)
#define SEG36 (1 << 4)
#define SEG37 (1 << 5)
#define SEG38 (1 << 6)
#define SEG39 (1 << 7)
#define SEG40 (1 << 8)
#define SEG41 (1 << 9)
#define SEG42 (1 << 10)
#define SEG43 (1 << 11)

#define FONT_ABCD 0
#define FONT_EGFx 1

#define DSP_COM1 0
#define DSP_COM2 1
#define DSP_COM3 2
#define DSP_COM4 3

#define LRAM_L_ADDR 0
#define LRAM_H_ADDR 1

typedef enum
{
    DSP_GET_V,
    DSP_GET_ADDR_INFO
} EN_DSP_GET_TYPE;

#if 1 /* bccho, LCD, 2023-08-04 */
#define LCD_DERR_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG05)
#define LCD_DERR_OFF

#define LCD_DRATE_A_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG00)
#define LCD_DRATE_A_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM4] &= ~(SEG00))

#define LCD_DRATE_B_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG00)
#define LCD_DRATE_B_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM3] &= ~(SEG00))

#define LCD_DRATE_C_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG00)
#define LCD_DRATE_C_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM2] &= ~(SEG00))

#define LCD_DRATE_D_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG00)
#define LCD_DRATE_D_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM1] &= ~(SEG00))

/* 둘째 decimal point */
#define LCD_DP2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG14)
#define LCD_DP2_OFF

/* 넷째 decimal point */
#define LCD_DP4_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG19)
#define LCD_DP4_OFF

/* 셋째 decimal point */
#define LCD_DP3_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG17)
#define LCD_DP3_OFF

/* 첫째 decimal point */
#define LCD_DP1_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG11)
#define LCD_DP1_OFF

#define LCD_DSUN_COMM_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG11)
#define LCD_DSUN_COMM_OFF

#define LCD_DBAT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG16)
#define LCD_DBAT_OFF

#define LCD_DQUP_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG03)
#define LCD_DQUP_OFF

#define LCD_DQDOWN_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG01)
#define LCD_DQDOWN_OFF

#define LCD_DQRIGHT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG02)
#define LCD_DQRIGHT_OFF

#define LCD_DQLEFT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG01)
#define LCD_DQLEFT_OFF

#define LCD_DPLS1_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG02)
#define LCD_DPLS1_OFF

#define LCD_DPLS2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG02)
#define LCD_DPLS2_OFF

#define LCD_DPLS3_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG01)
#define LCD_DPLS3_OFF

#define LCD_DPLS4_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG01)
#define LCD_DPLS4_OFF

#define LCD_DPLS5_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG02)
#define LCD_DPLS5_OFF

#define LCD_DCL_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG07)
#define LCD_DCL_OFF

#define LCD_DCONN_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG16)
#define LCD_DCONN_OFF

#define LCD_DTEST_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG09)
#define LCD_DTEST_OFF                      \
    (st_lcd_ram.com_xx_s31_00[DSP_COM1] &= \
     ~SEG31)  // jp.kim 24.11.08  LCD창 "TEST" 표시  off

/* bccho, 2024-09-05, 삼상 */
#define LCD_DV1_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG23)
#define LCD_DV1_OFF
#define LCD_DV2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG23)
#define LCD_DV2_OFF
#define LCD_DV3_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG23)
#define LCD_DV3_OFF

#define LCD_DLOAD_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG11)
#define LCD_DLOAD_OFF

#define LCD_DLOADO_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG12)
#define LCD_DLOADO_OFF

#define LCD_DLOADX_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG23)
#define LCD_DLOADX_OFF

#define LCD_DSECRET_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG16)
#define LCD_DSECRET_OFF

#define LCD_DCOLON1_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG11)
#define LCD_DCOLON1_OFF

