byungchul1885/amigo_m2354_jnd_production/nonsecure/src/App/platform/sec_meter/app/disp.h
#define LCD_DCOLON2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG16)
#define LCD_DCOLON2_OFF

#define LCD_DUNIT_k_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG21)
#define LCD_DUNIT_k_OFF

#define LCD_DUNIT_V1_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG21)
#define LCD_DUNIT_V1_OFF

#define LCD_DUNIT_V2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG21)
#define LCD_DUNIT_V2_OFF

#define LCD_DUNIT_A_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG21)
#define LCD_DUNIT_A_OFF

#define LCD_DUNIT_r_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG22)
#define LCD_DUNIT_r_OFF

#define LCD_DUNIT_h_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG22)
#define LCD_DUNIT_h_OFF

#define LCD_DUNIT_z_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG22)
#define LCD_DUNIT_z_OFF

#define LCD_DPERCENT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG22)
#define LCD_DPERCENT_OFF

///////////////////////////////////////////////////////////////////////
#define LCD_DP1_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG11)
#define LCD_DP2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG17)
#define LCD_DP3_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG19)
#define LCD_DP4_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG14)

#define LCD_DERR_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG05)
#define LCD_DMEM_IS_ON (false)
#define LCD_DBAT_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG16)
#define LCD_DCL_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG07)
#define LCD_DCONN_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG16)
#define LCD_DSECRET_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG16)
#define LCD_DTEST_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG09)

#define LCD_DV1_IS_ON (false)
#define LCD_DV2_IS_ON (false)
#define LCD_DV3_IS_ON (false)

#define LCD_DLOAD_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG11)
#define LCD_DLOADO_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG12)
#define LCD_DLOADX_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG23)

#define LCD_DCOLON1_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG11)
#define LCD_DCOLON2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG16)

#define LCD_DUNITK_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG21)
#define LCD_DUNITV1_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG21)
#define LCD_DUNITV2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG21)
#define LCD_DUNITA_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG21)
#define LCD_DUNITr_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG22)
#define LCD_DUNITh_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG22)
#define LCD_DUNITz_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG22)
#define LCD_DUNITPERC_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG22)

#define LCD_DQUP_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG03)
#define LCD_DQDOWN_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG01)
#define LCD_DQLEFT_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG01)
#define LCD_DQRIGHT_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG02)

#define LCD_DPLS1_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG02)
#define LCD_DPLS2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG02)
#define LCD_DPLS3_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG01)
#define LCD_DPLS4_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG01)
#define LCD_DPLS5_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG02)

#define LCD_DRATEA_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG00)
#define LCD_DRATEB_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG00)
#define LCD_DRATEC_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG00)
#define LCD_DRATED_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG00)
#else /* bccho, LCD, 2023-08-04 */
#define LCD_DERR_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG13)
#define LCD_DERR_OFF
#define LCD_DRATE_A_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG22)
#define LCD_DRATE_A_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM4] &= ~(SEG22))
#define LCD_DRATE_B_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG22)
#define LCD_DRATE_B_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM3] &= ~(SEG22))
#define LCD_DRATE_C_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG22)
#define LCD_DRATE_C_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM2] &= ~(SEG22))
#define LCD_DRATE_D_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG22)
#define LCD_DRATE_D_OFF (st_lcd_ram.com_xx_s31_00[DSP_COM1] &= ~(SEG22))
#define LCD_DP4_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] |= SEG41)
#define LCD_DP4_OFF
#define LCD_DP3_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG27)
#define LCD_DP3_OFF
#define LCD_DP2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG24)
#define LCD_DP2_OFF
#define LCD_DP1_ON (st_lcd_ram.com_xx_s43_32[DSP_COM2] |= SEG33)
#define LCD_DP1_OFF

#define LCD_DSUN_COMM_ON (st_lcd_ram.com_xx_s43_32[DSP_COM4] |= SEG33)
#define LCD_DSUN_COMM_OFF

#define LCD_DBAT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG26)
#define LCD_DBAT_OFF
#define LCD_DQUP_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG11)
#define LCD_DQUP_OFF
#define LCD_DQDOWN_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG05)
#define LCD_DQDOWN_OFF

#define LCD_DQRIGHT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG10)
#define LCD_DQRIGHT_OFF
#define LCD_DQLEFT_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG05)
#define LCD_DQLEFT_OFF

#define LCD_DPLS1_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG10)
#define LCD_DPLS1_OFF
#define LCD_DPLS2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG10)
#define LCD_DPLS2_OFF
#define LCD_DPLS3_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG05)
#define LCD_DPLS3_OFF
#define LCD_DPLS4_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG05)
#define LCD_DPLS4_OFF
#define LCD_DPLS5_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] |= SEG10)
#define LCD_DPLS5_OFF

#define LCD_DCL_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG15)
#define LCD_DCL_OFF
#define LCD_DCONN_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] |= SEG26)
#define LCD_DCONN_OFF
#define LCD_DTEST_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG31)
#define LCD_DTEST_OFF
#define LCD_DV1_ON
#define LCD_DV1_OFF
#define LCD_DV2_ON
#define LCD_DV2_OFF
#define LCD_DV3_ON
#define LCD_DV3_OFF
#define LCD_DLOAD_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] |= SEG33)
#define LCD_DLOAD_OFF
#define LCD_DLOADO_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] |= SEG34)
#define LCD_DLOADO_OFF
#define LCD_DLOADX_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] |= SEG39)
#define LCD_DLOADX_OFF
#define LCD_DSECRET_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] |= SEG26)
#define LCD_DSECRET_OFF
#define LCD_DCOLON1_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] |= SEG33)
#define LCD_DCOLON1_OFF
#define LCD_DCOLON2_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] |= SEG26)
#define LCD_DCOLON2_OFF
#define LCD_DUNIT_k_ON (st_lcd_ram.com_xx_s43_32[DSP_COM4] |= SEG37)
#define LCD_DUNIT_k_OFF
#define LCD_DUNIT_V1_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] |= SEG37)
#define LCD_DUNIT_V1_OFF
#define LCD_DUNIT_V2_ON (st_lcd_ram.com_xx_s43_32[DSP_COM2] |= SEG37)
#define LCD_DUNIT_V2_OFF
#define LCD_DUNIT_A_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] |= SEG37)
#define LCD_DUNIT_A_OFF
#define LCD_DUNIT_r_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] |= SEG38)
#define LCD_DUNIT_r_OFF
#define LCD_DUNIT_h_ON (st_lcd_ram.com_xx_s43_32[DSP_COM2] |= SEG38)
#define LCD_DUNIT_h_OFF
#define LCD_DUNIT_z_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] |= SEG38)
#define LCD_DUNIT_z_OFF
#define LCD_DPERCENT_ON (st_lcd_ram.com_xx_s43_32[DSP_COM4] |= SEG38)
#define LCD_DPERCENT_OFF

#define LCD_DP1_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM2] & SEG33)
#define LCD_DP2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG24)
#define LCD_DP3_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG27)
#define LCD_DP4_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] & SEG41)

#define LCD_DERR_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG13)
#define LCD_DMEM_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM4] & SEG33)
#define LCD_DBAT_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG26)
#define LCD_DCL_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG15)
#define LCD_DCONN_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG26)
#define LCD_DSECRET_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG26)
#define LCD_DTEST_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG31)

#define LCD_DV1_IS_ON (false)
#define LCD_DV2_IS_ON (false)
#define LCD_DV3_IS_ON (false)

#define LCD_DLOAD_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] & SEG33)
#define LCD_DLOADO_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] & SEG34)
#define LCD_DLOADX_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] & SEG39)

