byungchul1885/amigo_m2354_jnd_production/nonsecure/src/App/platform/sec_meter/app/disp.h
#define LCD_DCOLON1_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] & SEG33)
#define LCD_DCOLON2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG26)

#define LCD_DUNITK_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM4] & SEG37)
#define LCD_DUNITV1_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] & SEG37)
#define LCD_DUNITV2_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM2] & SEG37)
#define LCD_DUNITA_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] & SEG37)
#define LCD_DUNITr_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM1] & SEG38)
#define LCD_DUNITh_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM2] & SEG38)
#define LCD_DUNITz_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] & SEG38)
#define LCD_DUNITPERC_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM4] & SEG38)

#define LCD_DQUP_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG11)
#define LCD_DQDOWN_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG05)
#define LCD_DQLEFT_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG05)
#define LCD_DQRIGHT_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG10)

#define LCD_DPLS1_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG10)
#define LCD_DPLS2_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG10)
#define LCD_DPLS3_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG05)
#define LCD_DPLS4_IS_ON (st_lcd_ram.com_xx_s43_32[DSP_COM3] & SEG05)
#define LCD_DPLS5_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG10)

#define LCD_DRATEA_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM4] & SEG22)
#define LCD_DRATEB_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM3] & SEG22)
#define LCD_DRATEC_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM2] & SEG22)
#define LCD_DRATED_IS_ON (st_lcd_ram.com_xx_s31_00[DSP_COM1] & SEG22)
#endif /* bccho, LCD, 2023-08-04 */

extern uint32_t lcdmem[];
extern dsp_supply_type circ_state_suppdsp_mode;
extern int dsp_pulse_inc;
extern int dsp_pulse_inc_unit;
extern bool b_dsp_pulse_inc_timer;
extern uint8_t accmed_pls_inc;
extern int dsp_pulse_inc_timer;
extern int dsp_pulse_inc_timer_bak;
extern uint8_t lcd_map_comm[];

extern bool b_dsp_bm_finished;

void disp_init(void);
void disp_proc(void);
void dsp_blink_timer_proc(void);
void dsp_pwr_on(void);
void dsp_pwr_fail(void);
void dsp_circ_mode_chg_set(void);
void dsp_dmintv_set(uint8_t idx);
void dsp_test_state_init(void);
void dsp_circ_time_set(U8 bf_sec, U8 ss);
void dsp_cal_state(void);
void dsp_dr_state(void);
void dsp_calfail_state(void);
void dsp_DR_set(void);
void dsp_CalFail_set(void);
void dsp_calfail_state_exit(void);
void dsp_rcntdm_modified_set(void);
void dsp_allon(void);
void dsp_alloff(void);
void dsp_pulse_inc_set(int incr);
void dsp_fill_lcd_dot_comm(void);
bool dsp_is_test_overcurr(void);
void dsp_test_overcurr_toggle(void);
void dsp_test_condensor_toggle(void);
void dsp_test_err_pusle_toggle(void);
void dsp_test_auto_bidir_toggle(void);
bool dsp_test_mode_inc(void);
void dsp_test_smode_toggle(void);
void dsp_test_pvt_toggle(void);
bool dsp_is_test_mode_tS(void);
bool dsp_is_test_smode(void);
bool dsp_is_test_pvt(void);
bool dsp_is_test_trawmode(void);
void dsp_inp_init(date_time_type* pdt);
bool dsp_is_input_state(void);
disp_input_type get_dsp_inputmode(void);
uint8_t dsp_inp_digit_pos(void);
void dsp_inp_digit_inc(uint8_t mx);
void dsp_inp_digit_pos_move(uint8_t limit, uint8_t initval);
void dsp_inp_mtkind_inc(ratekind_type kind);
void dsp_inp_mtdir_toggle(void);
void dsp_inp_tou_rate_time(tou_struct_type* tou);
void dsp_inp_sig_sel(ad_sig_type sg);
void dsp_inp_digit_pos_move_tou(ratekind_type rtkind);
void dsp_inp_ts_toggle(uint8_t pos);
void dsp_inp_tourate_toggle(void);
uint8_t get_dispinp_ts_tourate(void);
void dsp_inp_err_set(void);
void dsp_inp_meas_toggle(void);
void dsp_inp_baud_toggle(void);
void dsp_inp_errpls_toggle(void);
void dsp_inp_condensor_toggle(void);
void dsp_inp_commen_toggle(void);
void dsp_inp_digit_inc_range(uint8_t mn, uint8_t mx);
void dsp_inp_ts_time(ts_struct_type* ts);
uint8_t get_dispinp_ts_ctrl(void);
void dsp_key_touched(void);
disp_state_type get_disp_state(void);
bool dsp_is_inp_end(void);
void dsp_circ_state_init(void);
void dsp_circ_state_mode_init(void);
void dsp_inp_time_init(date_time_type* pdt);
void dsp_inp_regrd_init(uint8_t regrd);
void dsp_inp_sigsel_init(ad_sig_type sg);
void dsp_inp_ts_init(ts_struct_type* ts);
void dsp_inp_scurr_init(uint16_t scurr);
void dsp_inp_scurr_2_init(int16_t scurr);
void dsp_inp_sCurrCnt_init(uint8_t cnt);
void dsp_inp_ratekind_init(ratekind_type mk);
void dsp_inp_tou_rate_init(tou_struct_type* tou);
uint8_t dsp_inp_lpintv_init(uint8_t intv);
void dsp_inp_sn1_init(void);
void dsp_inp_sn2_init(void);
void dsp_inp_mtdir_init(uint8_t dir);
void dsp_inp_meas_init(meas_method_type meas);
void dsp_inp_baud_init(baudrate_type baud);
void dsp_inp_temp_init(int8_t temp);
void dsp_inp_errpls_init(uint8_t pls);
void dsp_inp_condensor_init(uint8_t conds);
void dsp_inp_commen_init(uint8_t commen);
void dsp_inp_scurr_hold_init(uint16_t _hold);
void dsp_inp_scurr_n1_init(uint8_t _cnt);
void dsp_inp_scurr_dur1_init(uint16_t _dur1);
void dsp_inp_scurr_dur2_init(uint16_t _dur2);
void dsp_inp_contract_month_init(uint32_t _contract);
void dsp_inp_end_init(void);
uint8_t get_dispinp_year(void);
uint8_t get_dispinp_month(void);
uint8_t get_dispinp_date(void);
uint8_t get_dispinp_hour(void);
uint8_t get_dispinp_min(void);
uint16_t get_dispinp_sCurr(void);
uint8_t get_dispinp_sCurrCnt(void);
uint8_t get_dispinp_tou_hour(void);
uint8_t get_dispinp_tou_min(void);
uint8_t get_dispinp_ratekind(void);
uint8_t get_dispinp_lpintv(void);
uint8_t get_dispinp_mtdir(void);
meas_method_type get_dispinp_meas(void);
baudrate_type get_dispinp_baud(void);
int8_t get_dispinp_temp(void);
uint8_t get_dispinp_errpls(void);
uint8_t get_dispinp_condensor(void);
uint8_t get_dispinp_commen(void);
uint16_t get_dispinp_scurr_dur(void);
uint8_t get_dispinp_scurr_n1(void);
uint32_t get_dispinp_contract_month(void);
bool dsp_is_suppmode_and_available(void);

extern bool dsp_is_test_reg_mr_date(void);
extern void dsp_test_reg_mr_date_change(void);
extern bool dsp_is_test_tariff_rate(void);
extern void dsp_test_tariff_rate_change(void);
void dsp_test(void);
void dsp_date(date_time_type* dt);
void dsp_time(date_time_type* dt);
void dsp_digit(int32_t val, uint8_t dgt, uint8_t point, bool lead_zero);
void dsm_dsp_digit_update(void);

void dsp_enter_lpm(void);
void dsp_low_pwr_entry_state(uint32_t dsp_idx);
void dsp_debug_state(uint32_t dsp_idx);
void dsp_up_pwr_on_state(void);
void dsp_r_sun_dsp_set(void);
void dsp_on_sun_dsp_set(void);

#endif
